{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      " ": 5, 
      "!": 6,
      "\"": 7, 
      "#": 8, 
      "$": 9, 
      "&": 10, 
      "'": 11, 
      "(": 12, 
      ")": 13, 
      ",": 14, 
      "-": 15, 
      ".": 16, 
      "/": 17, 
      "0": 18, 
      "1": 19, 
      "2": 20, 
      "3": 21, 
      "4": 22, 
      "5": 23, 
      "6": 24, 
      "7": 25, 
      "8": 26, 
      "9": 27, 
      ":": 28, 
      ";": 29, 
      "?": 30, 
      "a": 31, 
      "b": 32, 
      "c": 33, 
      "d": 34,
      "e": 35, 
      "f": 36, 
      "g": 37, 
      "h": 38, 
      "i": 39, 
      "j": 40, 
      "k": 41, 
      "l": 42, 
      "m": 43, 
      "n": 44, 
      "o": 45, 
      "p": 46, 
      "q": 47, 
      "r": 48, 
      "s": 49, 
      "t": 50, 
      "u": 51, 
      "v": 52, 
      "w": 53, 
      "x": 54, 
      "y": 55, 
      "z": 56
    },
    "merges": [
    ]
  }
}